benchmark-output/storage-engine-hybrid/outputRun-f-10000.log
2021-05-12 14:24:04:693 0 sec: 0 operations; est completion in 0 second 
2021-05-12 14:24:13:553 8 sec: 10000 operations; 1117.94 current ops/sec; [READ AverageLatency(us)=589.68] [READ-MODIFY-WRITE AverageLatency(us)=1167.32] [CLEANUP AverageLatency(us)=562] [UPDATE AverageLatency(us)=571.24] 
[OVERALL], RunTime(ms), 8945
[OVERALL], Throughput(ops/sec), 1117.9429849077696
[TOTAL_GCS_G1_Young_Generation], Count, 3
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 20
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.22358859698155395
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 3
[TOTAL_GC_TIME], Time(ms), 20
[TOTAL_GC_TIME_%], Time(%), 0.22358859698155395
[READ], Operations, 10000
[READ], AverageLatency(us), 589.6846
[READ], MinLatency(us), 200
[READ], MaxLatency(us), 19911
[READ], Return=OK, 10000
[READ], 0, 772.0672169811321
[READ], 1000, 752.698901098901
[READ], 2000, 653.3002973240832
[READ], 3000, 650.3161478599221
[READ], 4000, 529.0658001624695
[READ], 5000, 553.7244480784955
[READ], 6000, 504.66641279512567
[READ], 7000, 514.5533625730994
[READ], 8000, 499.48691588785044
[READ-MODIFY-WRITE], Operations, 4906
[READ-MODIFY-WRITE], AverageLatency(us), 1167.315124337546
[READ-MODIFY-WRITE], MinLatency(us), 410
[READ-MODIFY-WRITE], MaxLatency(us), 23391
[READ-MODIFY-WRITE], 0, 1543.6423529411766
[READ-MODIFY-WRITE], 1000, 1392.4704545454545
[READ-MODIFY-WRITE], 2000, 1231.5499058380415
[READ-MODIFY-WRITE], 3000, 1299.7784431137725
[READ-MODIFY-WRITE], 4000, 1102.0226171243942
[READ-MODIFY-WRITE], 5000, 1097.1938250428816
[READ-MODIFY-WRITE], 6000, 1027.5870253164558
[READ-MODIFY-WRITE], 7000, 973.0721966205837
[READ-MODIFY-WRITE], 8000, 1046.2786259541986
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 562.0
[CLEANUP], MinLatency(us), 562
[CLEANUP], MaxLatency(us), 562
[CLEANUP], 0, 562.0
[UPDATE], Operations, 4906
[UPDATE], AverageLatency(us), 571.2392988177742
[UPDATE], MinLatency(us), 204
[UPDATE], MaxLatency(us), 12114
[UPDATE], Return=OK, 4906
[UPDATE], 0, 747.1905882352942
[UPDATE], 1000, 683.2840909090909
[UPDATE], 2000, 610.9962335216572
[UPDATE], 3000, 629.2135728542914
[UPDATE], 4000, 538.767366720517
[UPDATE], 5000, 530.6466552315609
[UPDATE], 6000, 519.0427215189874
[UPDATE], 7000, 439.0783410138249
[UPDATE], 8000, 549.3988549618321